#터미널(CLI)관련 명령어 정리 

# https://yozm.wishket.com/magazine/detail/746/
# 윈도우랑 환경이 좀 달라서 여기서 확인해보시고 실습해보시면됩니다 
# =>기본 of 기본입니다 그냥 알파벳이다 생각하고 외우시면됩니다.(같은기능인데 원도우랑 명령어가 다를 순 있음)
# 터미널 들어가는 방법은 command + space누르면 spotlight창이 뜰고거 거기에 terminal치면 나옵니다.

# CLI가 나오고 편하게하기위해서 GUI가 나왔으므로 
# CLI에서는 가능하지만 GUI에서는 안되는 일이 있을 순 있음
# GUI에서 된다는것은 CLI로 무조건 된다는 전제가 깔려있기 때문애 CLI로 습관을 들으면 혹시나 모를 에러를 미연에 방지할 수 있음
# 쉽게말하면 키보드로만 처리하면 CLI고 마우스를 사용하면 GUI라고 생각해도 됩니다.
# 터미널에 들어가서 하는것은 마우스를 사용하지않고 키보드만 사용하므로 CLI라고 할 수 있습니다.